'use client'

import Player from "@/component";

const VIDEODATA = {
  url: '/videos/hls_output/master.m3u8',
  duration: 9.333,
  fragments: []


  // url: '/videos/long-video/longVideo.m3u8',
  // duration: 552.333,
  // fragments: []
  // fragments: [
  //   {
  //     start: 0.000,
  //     end: 22.517,
  //     title: 'Вступление'
  //   },
  //   {
  //     start: 22.517,
  //     end: 45.033,
  //     title: 'Проблематизация темы'
  //   },
  //   {
  //     start: 45.033,
  //     end: 67.550,
  //     title: 'Представление эксперта'
  //   },
  //   {
  //     start: 67.550,
  //     end: 90.066,
  //     title: 'Ожидания от просмотра'
  //   },
  //   {
  //     start: 90.066,
  //     end: 112.583,
  //     title: 'Исторический контекст'
  //   },
  //   {
  //     start: 112.583,
  //     end: 135.099,
  //     title: 'Ключевые термины'
  //   },
  //   {
  //     start: 135.099,
  //     end: 157.616,
  //     title: 'Основная теория'
  //   },
  //   {
  //     start: 157.616,
  //     end: 180.132,
  //     title: 'Практический пример 1'
  //   },
  //   {
  //     start: 180.132,
  //     end: 202.649,
  //     title: 'Разбор кейса'
  //   },
  //   {
  //     start: 202.649,
  //     end: 225.165,
  //     title: 'Типичные ошибки'
  //   },
  //   {
  //     start: 225.165,
  //     end: 247.682,
  //     title: 'Методика решения'
  //   },
  //   {
  //     start: 247.682,
  //     end: 270.198,
  //     title: 'Инструменты анализа'
  //   },
  //   {
  //     start: 270.198,
  //     end: 292.715,
  //     title: 'Практический пример 2'
  //   },
  //   {
  //     start: 292.715,
  //     end: 315.231,
  //     title: 'Сравнительный анализ'
  //   },
  //   {
  //     start: 315.231,
  //     end: 337.748,
  //     title: 'Нюансы реализации'
  //   },
  //   {
  //     start: 337.748,
  //     end: 360.264,
  //     title: 'Вопросы внедрения'
  //   },
  //   {
  //     start: 360.264,
  //     end: 382.781,
  //     title: 'Измерение результатов'
  //   },
  //   {
  //     start: 382.781,
  //     end: 405.297,
  //     title: 'Оптимизация процесса'
  //   },
  //   {
  //     start: 405.297,
  //     end: 427.814,
  //     title: 'Дополнительные ресурсы'
  //   },
  //   {
  //     start: 427.814,
  //     end: 450.330,
  //     title: 'Частые вопросы'
  //   },
  //   {
  //     start: 450.330,
  //     end: 472.847,
  //     title: 'Рекомендации эксперта'
  //   },
  //   {
  //     start: 472.847,
  //     end: 495.363,
  //     title: 'Дальнейшие шаги'
  //   },
  //   {
  //     start: 495.363,
  //     end: 517.880,
  //     title: 'Итоги и выводы'
  //   },
  //   {
  //     start: 517.880,
  //     end: 540.396,
  //     title: 'Заключительные слова'
  //   },
  //   {
  //     start: 540.396,
  //     end: 552.333,
  //     title: 'Финальные титры'
  //   }
  // ]


  // url: '/videos/test2/outTest2.m3u8',
  // duration: 85.333,
  // fragments : [
  //   {
  //     start: 0.000,
  //     end: 5.000,
  //     title: 'не начало'
  //   },
  //   {
  //     start: 5.000,
  //     end: 10.000,
  //     title: 'не начало'
  //   },
  //   {
  //     start: 10.000,
  //     end: 12.00,
  //     title: 'не начало'
  //   },
  //   {
  //     start: 12.000,
  //     end: 15.000,
  //     title: 'не начало'
  //   },
  //   {
  //     start: 15.000,
  //     end: 40.000,
  //     title: 'не начало'
  //   },
  //   {
  //     start: 40.000,
  //     end: 70.000,
  //     title: 'экспозиция'
  //   },
  //   {
  //     start: 70.000,
  //     end: 75.000,
  //     title: 'контент'
  //   },
  //   {
  //     start: 75.000,
  //     end: 85.333,
  //     title: 'концовка'
  //   },
  // ]


  // url: '/videos/test4/master-playlist.m3u8',
  // duration: 9.585,
  // fragments : [
  //   {
  //     start: 0.000,
  //     end: 2.000,
  //     title: 'не начало не начало не начало не начало не начало не начало не начало не начало не начало не начало не начало не начало не начало не начало'
  //   },
  //   {
  //     start: 2.000,
  //     end: 4.000,
  //     title: 'экспозиция'
  //   },
  //   {
  //     start: 4.000,
  //     end: 7.000,
  //     title: 'контент'
  //   },
  //   {
  //     start: 7.000,
  //     end: 9.585,
  //     title: 'концовка'
  //   },
  // ]
}

export default function Home() {

  return (
    <Player playlistUrl={VIDEODATA.url} duration={VIDEODATA.duration} fragments={VIDEODATA.fragments}/>
  );
}
